app/controllers/reports_controller.rb

SELECT * FROM "reports"
SELECT count(*) AS count_all FROM "reports"
SELECT count(*) AS count_all FROM "users"
---
  def index
    params[:subjects] ||= []
    if params[:term].present?
      @title = 'Matching Reports'
      @reports = Report.paginated_search(params).results
    elsif params[:without_causes].present?
      @title = 'Reports without Causes'
      @reports = Report.non_cause.published.without_associated_cause.by_name.for_display.paginate(:page => params[:page])
    elsif params[:from_members]
      @title = 'Member Reports'
      @reports = topical_reports.user_published.by_name.paginate(:page => params[:page])