app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "username", "persistence_token", "email", "created_at") VALUES(NULL, '2009-11-21 18:55:49.274191', NULL, NULL, NULL, NULL, '2009-11-21 18:55:49.274191') RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save